Revit 2027 API
ExtendedPropertiesBindings Methods
The ExtendedPropertiesBindings type exposes the following members.
Methods
Name | Description
AddCategories |  Adds multiple categories to the bindings.
AddCategory |  Adds a category id to the bindings.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace